Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.9/PIC32CK-GC01/armcc/armcc/startup_pic32ck2051gc01100.s
FCR_ERR_Handler          
FCR_FLT_Handler          
FCW_Handler              
PM_Handler               
SUPC_Handler             
OSCCTRL_XOSC_Handler     
OSCCTRL_DFLL_Handler     
OSCCTRL_PLL0_Handler     
OSC32KCTRL_Handler       
MCLK_Handler             
FREQM_Handler            
WDT_Handler              
RTC_Handler              
EIC_EXTINT_0_Handler     
EIC_EXTINT_1_Handler     
EIC_EXTINT_2_Handler     
EIC_EXTINT_3_Handler     
EIC_EXTINT_4_Handler     
EIC_EXTINT_5_Handler     
EIC_EXTINT_6_Handler     
EIC_EXTINT_7_Handler     
EIC_EXTINT_8_Handler     
EIC_EXTINT_9_Handler     
EIC_EXTINT_10_Handler    
EIC_EXTINT_11_Handler    
EIC_EXTINT_12_Handler    
EIC_EXTINT_13_Handler    
EIC_EXTINT_14_Handler    
EIC_EXTINT_15_Handler    
EIC_NSCHK_Handler        
PAC_Handler              
TRAM_Handler             
PORT_Handler             
DMA0_PRI0_Handler        
DMA0_PRI1_Handler        
DMA0_PRI2_Handler        
DMA1_PRI0_Handler        
DMA1_PRI1_Handler        
HMATRIX_Handler          
EVSYS_0_Handler          
EVSYS_1_Handler          
EVSYS_2_Handler          
EVSYS_3_Handler          
EVSYS_OTHER_Handler      
SERCOM0_56_Handler       
SERCOM0_0_Handler        
SERCOM0_1_Handler        
SERCOM0_2_Handler        
SERCOM0_3_Handler        
SERCOM0_4_Handler        
SERCOM1_56_Handler       
SERCOM1_0_Handler        
SERCOM1_1_Handler        
SERCOM1_2_Handler        
SERCOM1_3_Handler        
SERCOM1_4_Handler        
SERCOM2_56_Handler       
SERCOM2_0_Handler        
SERCOM2_1_Handler        
SERCOM2_2_Handler        
SERCOM2_3_Handler        
SERCOM2_4_Handler        
SERCOM3_56_Handler       
SERCOM3_0_Handler        
SERCOM3_1_Handler        
SERCOM3_2_Handler        
SERCOM3_3_Handler        
SERCOM3_4_Handler        
TCC0_OTHER_Handler       
TCC0_MC_0_Handler        
TCC0_MC_1_Handler        
TCC0_MC_2_Handler        
TCC0_MC_3_Handler        
TCC0_MC_4_Handler        
TCC0_MC_5_Handler        
TCC1_OTHER_Handler       
TCC1_MC_0_Handler        
TCC1_MC_1_Handler        
TCC1_MC_2_Handler        
TCC1_MC_3_Handler        
TCC1_MC_4_Handler        
TCC1_MC_5_Handler        
TCC2_OTHER_Handler       
TCC2_MC_0_Handler        
TCC2_MC_1_Handler        
TCC2_MC_2_Handler        
TCC2_MC_3_Handler        
TCC2_MC_4_Handler        
TCC2_MC_5_Handler        
TCC3_OTHER_Handler       
TCC3_MC_0_Handler        
TCC3_MC_1_Handler        
TCC3_MC_2_Handler        
TCC3_MC_3_Handler        
TCC3_MC_4_Handler        
TCC3_MC_5_Handler        
SERCOM4_56_Handler       
SERCOM4_0_Handler        
SERCOM4_1_Handler        
SERCOM4_2_Handler        
SERCOM4_3_Handler        
SERCOM4_4_Handler        
SERCOM5_56_Handler       
SERCOM5_0_Handler        
SERCOM5_1_Handler        
SERCOM5_2_Handler        
SERCOM5_3_Handler        
SERCOM5_4_Handler        
SERCOM6_56_Handler       
SERCOM6_0_Handler        
SERCOM6_1_Handler        
SERCOM6_2_Handler        
SERCOM6_3_Handler        
SERCOM6_4_Handler        
SERCOM7_56_Handler       
SERCOM7_0_Handler        
SERCOM7_1_Handler        
SERCOM7_2_Handler        
SERCOM7_3_Handler        
SERCOM7_4_Handler        
TCC4_OTHER_Handler       
TCC4_MC_0_Handler        
TCC4_MC_1_Handler        
TCC5_OTHER_Handler       
TCC5_MC_0_Handler        
TCC5_MC_1_Handler        
TCC6_OTHER_Handler       
TCC6_MC_0_Handler        
TCC6_MC_1_Handler        
TCC7_OTHER_Handler       
TCC7_MC_0_Handler        
TCC7_MC_1_Handler        
ADC_0_Handler            
ADC_1_Handler            
ADC_2_Handler            
ADC_3_Handler            
ADC_4_Handler            
ADC_5_Handler            
AC_Handler               
PTC_Handler              
SPI_IXS_Handler          
PCC_Handler              
PDEC_Handler             
CAN0_Handler             
CAN1_Handler             
ETH_Handler              
SQI_Handler              
TRNG_Handler             
SDMMC0_Handler           
SDMMC1_Handler           
USB_OTHER_Handler        
USB_SOF_Handler          
USB_TRCPT0_Handler       
USB_TRCPT1_Handler       
USBHS_Handler            
                B       .
                ENDP


                ALIGN


; User Initial Stack & Heap

                IF      :DEF:__MICROLIB

                EXPORT  __initial_sp
                EXPORT  __heap_base
                EXPORT  __heap_limit

                ELSE

                IMPORT  __use_two_region_memory
                EXPORT  __user_initial_stackheap
__user_initial_stackheap

                LDR     R0, =  Heap_Mem
                LDR     R1, =(Stack_Mem + Stack_Size)
                LDR     R2, = (Heap_Mem +  Heap_Size)
                LDR     R3, = Stack_Mem
                BX      LR

                ALIGN

                ENDIF


                END

